brew "argocd"
brew "argocd-vault-plugin"
brew "bat"
brew "curl"
brew "direnv"
brew "dotnet"
brew "exa"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "hadolint"
brew "helm"
brew "jq"
brew "minikube"
brew "nano"
brew "neovim"
brew "node"
brew "pandoc"
brew "pipx"
brew "pyenv-virtualenv"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "topgrade"
brew "w3m"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "hashicorp/tap/vault"
brew "ubuntu/microk8s/microk8s"

if OS.mac?
    brew "mas"
    cask "balenaetcher"
    cask "codeql"
    cask "docker"
    cask "font-fira-code-nerd-font"
    cask "font-fira-mono-for-powerline"
    cask "font-hack-nerd-font"
    cask "font-inconsolata-nerd-font"
    cask "font-meslo-lg-nerd-font"
    cask "gpg-suite-no-mail"
    cask "iterm2"
    cask "multipass"
    cask "powershell"
    cask "visual-studio-code"

    mas "Amphetamine", id: 937984704
    mas "Dark Reader for Safari", id: 1438243180
    mas "iStat Menus", id: 1319778037
    mas "Keynote", id: 409183694
    mas "Magnet", id: 441258766
    mas "MindNode", id: 1289197285
    mas "Numbers", id: 409203825
    mas "Pages", id: 409201541
    mas "Strongbox", id: 897283731
    mas "The Unarchiver", id: 425424353

    vscode "bierner.github-markdown-preview"
    vscode "bierner.markdown-checkbox"
    vscode "bierner.markdown-emoji"
    vscode "bierner.markdown-footnotes"
    vscode "bierner.markdown-mermaid"
    vscode "bierner.markdown-preview-github-styles"
    vscode "bierner.markdown-yaml-preamble"
    vscode "bradlc.vscode-tailwindcss"
    vscode "DavidAnson.vscode-markdownlint"
    vscode "eamodio.gitlens"
    vscode "EditorConfig.EditorConfig"
    vscode "elagil.pre-commit-helper"
    vscode "esbenp.prettier-vscode"
    vscode "exiasr.hadolint"
    vscode "foxundermoon.shell-format"
    vscode "GitHub.codespaces"
    vscode "GitHub.copilot"
    vscode "GitHub.copilot-chat"
    vscode "GitHub.github-vscode-theme"
    vscode "GitHub.remotehub"
    vscode "GitHub.vscode-codeql"
    vscode "github.vscode-github-actions"
    vscode "GitHub.vscode-pull-request-github"
    vscode "golang.go"
    vscode "hbenl.vscode-test-explorer"
    vscode "jock.svg"
    vscode "kennylong.kubernetes-yaml-formatter"
    vscode "mads-hartmann.bash-ide-vscode"
    vscode "mindaro-dev.file-downloader"
    vscode "mindaro.mindaro"
    vscode "ms-azuretools.vscode-docker"
    vscode "ms-dotnettools.vscode-dotnet-runtime"
    vscode "ms-kubernetes-tools.vscode-aks-tools"
    vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
    vscode "ms-python.black-formatter"
    vscode "ms-python.flake8"
    vscode "ms-python.isort"
    vscode "ms-python.python"
    vscode "ms-python.vscode-pylance"
    vscode "ms-toolsai.jupyter-keymap"
    vscode "ms-vscode-remote.remote-containers"
    vscode "ms-vscode-remote.remote-ssh"
    vscode "ms-vscode-remote.remote-ssh-edit"
    vscode "ms-vscode-remote.remote-wsl"
    vscode "ms-vscode-remote.vscode-remote-extensionpack"
    vscode "ms-vscode.cpptools"
    vscode "ms-vscode.cpptools-extension-pack"
    vscode "ms-vscode.cpptools-themes"
    vscode "ms-vscode.makefile-tools"
    vscode "ms-vscode.powershell"
    vscode "ms-vscode.remote-explorer"
    vscode "ms-vscode.remote-repositories"
    vscode "ms-vscode.remote-server"
    vscode "ms-vscode.test-adapter-converter"
    vscode "rebornix.ruby"
    vscode "redhat.vscode-xml"
    vscode "redhat.vscode-yaml"
    vscode "tamasfe.even-better-toml"
    vscode "vscode-icons-team.vscode-icons"
    vscode "wingrunr21.vscode-ruby"
    vscode "yzhang.markdown-all-in-one"
end
