tap "azure/bicep"
tap "azure/functions"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
brew "autoconf"
brew "automake"
brew "azure-cli"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bzip2"
brew "c-blosc"
brew "pkg-config"
brew "cmake"
brew "dfu-util"
brew "direnv"
brew "esptool"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "gradle"
brew "hackrf"
brew "hdf5"
brew "libtool"
brew "maven"
brew "minikube"
brew "mono-libgdiplus"
brew "nvm"
brew "openblas"
brew "openssl@3"
brew "platformio"
brew "pulumi"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "shellcheck"
brew "shfmt"
brew "shtool"
brew "tcl-tk"
brew "topgrade"
brew "uncrustify"
brew "wget"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "azure/bicep/bicep"
brew "azure/functions/azure-functions-core-tools@4"
cask "balenaetcher"
cask "binance"
cask "calibre"
cask "cheatsheet"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-source-code-pro"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "ngrok"
cask "postman"
cask "powershell"
cask "qbittorrent"
cask "streamlabs-obs"
cask "thonny-xxl"
cask "tor-browser"
cask "wireshark"
cask "xquartz"
cask "youtube-downloader"
